examples/pinhole25/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-9;
        relTol           0;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }
    pcorrFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.0001;
    }
    
    UFinal
    {
        $U;
        relTol          0;
    }
    
    A
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          1e-6;
    }
    
    AFinal
    {
        $A;
        relTol          0;
    }

    c
    {
        solver           PBiCG;
        tolerance        1e-12;
        relTol           1e-6;
        preconditioner   DILU;
    }
    cFinal
    {
        $c;
        relTol          0;
    }   
}

PIMPLE
{
    nNonOrthogonalCorrectors 1;
    nCorrectors          2;
    nOuterCorrectors    20;
    momentumPredictor no;
    consistent true;
 
    outerCorrectorResidualControl
    {
        p
        {
            tolerance 1e-7;
            relTol 0.02;
        }
     }
}
 
relaxationFactors
{
    fields
    {
        p               .9;
        pFinal          1;
        c               .9;
        cFinal          1;
    }
    equations
    {
        U               .5;
        UFinal          1;
    }
}


// ************************************************************************* //
